<?session_start();
	include("lib/config.inc.php");
	include("lib/database.class.php");

	$obj_db = new database();
	$obj_db->connect_pep();

	// วัน เดือน ปี ปัจจุบัน
	$date_report = date("d")."/".date("m")."/".(date("Y")+543);

?>
<!DOCTYPE html>
<html>
<head>
	<title><?=$webSite['title'] ?></title>
	<?=$webSite['meta']; ?>
	<!-- Bootstrap -->
	<link href="css/bootstrap.min.css" rel="stylesheet">
	<link rel="stylesheet" type="text/css" href="css/DT_bootstrap.css">
	<link href="css/style_calendar.css" rel="stylesheet" type="text/css">
	<!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
	<!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
	<!--[if lt IE 9]>
		<script src="js/html5shiv.js"></script>
		<script src="js/respond.min.js"></script>
		<script src="js/ie8-responsive-file-warning.js"></script>
	<![endif]-->

<!-- <script type="text/javascript" src="js/databranch_area_9_div.js"></script> -->

<script language="JavaScript">

	var arrDiv = new Array();
	arrDiv[0] = new Array('0-รวมประเทศ-','1ภาคเหนือตอนบน','2ภาคเหนือตอนล่าง','3ภาคตะวันออกเฉียงเหนือตอนบน','4ภาคตะวันออกเฉียงเหนือตอนล่าง','5ภาคกลาง','6ภาคตะวันออก','7ภาคตะวันตก','8ภาคใต้ตอนบน','9ภาคใต้ตอนล่าง');
	var arrData = new Array();
	arrData[1] = new Array('01สนจ.เชียงราย','08สนจ.แพร่','23สนจ.เชียงใหม่','29สนจ.ลำปาง','47สนจ.ลำพูน','56สนจ.น่าน','72สนจ.พะเยา','82สนจ.แม่ฮ่องสอน');
	arrData[2] = new Array('02สนจ.เพชรบูรณ์','09สนจ.สุโขทัย','18สนจ.นครสวรรค์','27สนจ.พิษณุโลก','28สนจ.พิจิตร','36สนจ.กำแพงเพชร','48สนจ.อุตรดิตถ์','49สนจ.อุทัยธานี','81สนจ.ตาก');
	arrData[3] = new Array('05สนจ.อุดรธานี','06สนจ.ขอนแก่น','22สนจ.ร้อยเอ็ด','32สนจ.กาฬสินธุ์','33สนจ.เลย','37สนจ.สกลนคร','38สนจ.นครพนม','46สนจ.มหาสารคาม','52สนจ.หนองคาย','71สนจ.หนองบัวลำภู','73สนจ.มุกดาหาร','85สนจ.บึงกาฬ');
	arrData[4] = new Array('12สนจ.ชัยภูมิ','21สนจ.นครราชสีมา','26สนจ.สุรินทร์','39สนจ.ศรีสะเกษ','40สนจ.บุรีรัมย์','50สนจ.อุบลราชธานี','51สนจ.ยโสธร','77สนจ.อำนาจเจริญ');
	arrData[5] = new Array('03สนจ.พระนครศรีอยุธยา','07สนจ.สระบุรี','16สนจ.ลพบุรี','17สนจ.ชัยนาท','20สนจ.นนทบุรี','30สนจ.อ่างทอง','58สนจ.กรุงเทพมหานคร','67สนจ.ปทุมธานี','69สนจ.สิงห์บุรี');
	arrData[6] = new Array('10สนจ.ปราจีนบุรี','13สนจ.ระยอง','25สนจ.ฉะเชิงเทรา','41สนจ.นครนายก','42สนจ.จันทบุรี','53สนจ.ชลบุรี','78สนจ.สระแก้ว','79สนจ.ตราด','80สนจ.สมุทรปราการ');
	arrData[7] = new Array('04สนจ.เพชรบุรี','14สนจ.สุพรรณบุรี','24สนจ.นครปฐม','35สนจ.ประจวบคีรีขันธ์','43สนจ.ราชบุรี','44สนจ.กาญจนบุรี','54สนจ.สมุทรสาคร','74สนจ.สมุทรสงคราม');
	arrData[8] = new Array('19สนจ.ชุมพร','31สนจ.สุราษฎร์ธานี','60สนจ.พังงา','76สนจ.กระบี่','83สนจ.ระนอง','84สนจ.ภูเก็ต');
	arrData[9] = new Array('11สนจ.ปัตตานี','15สนจ.นครศรีธรรมราช','34สนจ.สงขลา','45สนจ.พัทลุง','55สนจ.นราธิวาส','57สนจ.ตรัง','61สนจ.ยะลา','75สนจ.สตูล');
	var arrBrn = new Array();
	arrBrn[01] = new Array('0100เชียงราย','0101พาน','0102แม่สรวย','0103แม่จัน','0104เชียงแสน','0105วาวี','0106แม่สาย','0107เวียงชัย','0108เวียงป่าเป้า','0109ป่าแดด','0111เทิง','0112เชียงของ','0113พญาเม็งราย','0114ขุนตาล','0115ปล้อง','0116เวียงแก่น','0119บุญเรือง','0120แม่ลาว','0121เจริญเมือง','0122เวียงเชียงรุ้ง','0123นางแล','0124ม่วงคำ','0125ห้วยสัก','0126ท่าต้นเกี๋ยง','0127จันจว้า','0128เจดีย์หลวง','0129แม่ขะจาน','0130วัดร่องขุ่น'); 
	arrBrn[02] = new Array('0200เพชรบูรณ์','0201หล่มสัก','0202ชนแดน','0203หล่มเก่า','0204วังโป่ง','0205ท่าพล','0206บึงสามพัน','0207พุเตย','0208หนองไผ่','0209ศรีเทพ','0211วิเชียรบุรี','0212วังชมภู','0213นาเฉลียง','0214ดงขวาง','0215กกกะทอน','0216วังพิกุล','0218บ้านโคกเพชรบูรณ์','0219ดงขุย','0220น้ำหนาว','0221สามแยกวิเชียรบุรี','0222บ้านกลาง','0223ปากน้ำ','0224บ้านติ้ว','0225ท่าแดง'); 
	arrBrn[03] = new Array('0300พระนครศรีอยุธยา','0301วังน้อย','0302เสนา','0303ท่าเรือ','0304ลาดบัวหลวง','0305บางปะอิน','0306บางปะหัน','0307อุทัย','0314ผักไห่','0316บางไทร','0317ภาชี','0318เจ้าปลุก'); 
	arrBrn[04] = new Array('0400เพชรบุรี','0401ชะอำ','0402ท่ายาง','0403บ้านลาด','0404เขาย้อย','0407บ้านแหลม','0408เขาลูกช้าง'); 
	arrBrn[05] = new Array('0500อุดรธานี','0501น้ำโสม','0502กุมภวาปี','0503บ้านผือ','0504ศรีธาตุ','0505หนองหาน','0506บ้านดุง','0507หนองวัวซอ','0508โนนสะอาด','0509เพ็ญ','0511กุดจับ','0512ทุ่งฝน','0513วังสามหมอ','0514เมืองโนนสูง','0515พันดอน','0516ไชยวาน','0517โนนหวาย','0518นายูง','0519หนองแสง','0520กู่แก้ว'); 
	arrBrn[06] = new Array('0600ขอนแก่น','0601บ้านไผ่','0602หนองสองห้อง','0603ชุมแพ','0604น้ำพอง','0605มัญจาคีรี','0606ตลาดกลางสินค้าเกษตรขอนแก่น','0607ภูเวียง','0608เมืองพล','0609หนองเรือ','0611กระนวน','0612ชนบท','0613สีชมพู','0614แวงน้อย','0615บ้านฝาง','0618เขาสวนกวาง','0619โนนหัน','0620แวงใหญ่','0621พระยืน','0622ซำสูง','0623โนนศิลา','0624อุบลรัตน์','0625โคกโพธิ์ไชย','0626เปือยน้อย'); 
	arrBrn[07] = new Array('0700สระบุรี','0701พระพุทธบาท','0702มวกเหล็ก','0703แก่งคอย','0704หนองแค','0705บ้านหมอ','0706วิหารแดง','0707วังม่วง','0078เสาไห้'); 
	arrBrn[08] = new Array('0800แพร่','0801ร้องกวาง','0802ลอง','0803สอง','0804สูงเม่น','0805วังชิ้น','0806เด่นชัย','0807หนองม่วงไข่','0808ทุ่งโฮ้ง','0809เวียงทอง','0810แม่หล่าย'); 
	arrBrn[09] = new Array('0900สุโขทัย','0901สวรรคโลก','0902กงไกรลาศ','0903ศรีสัชนาลัย','0904ศรีสำโรง','0905คีรีมาศ','0906ทุ่งเสลี่ยม','0907ศรีนคร','0908บ้านด่านลานหอย','0909บ้านไร่ศรีสำโรง','0911ท่าชัย','0912บ้านกล้วย','0913ไกรกลาง','0914แม่สิน','0915นาทุ่ง'); 
	arrBrn[10] = new Array('1000ปราจีนบุรี','1002กบินทร์บุรี','1004บ้านสร้าง','1006ศรีมหาโพธิ','1007ประจันตคาม','1008นาดี','1009วังท่าช้าง'); 
	arrBrn[11] = new Array('1100ปัตตานี','1106นาประดู่','1107ปาลัส','1108สายบุรี','1109โคกโพธิ์','1110หนองจิก'); 
	arrBrn[12] = new Array('1200ชัยภูมิ','1201จัตุรัส','1202ภูเขียว','1203บำเหน็จณรงค์','1204แก้งคร้อ','1205คอนสวรรค์','1206บ้านเขว้า','1207เกษตรสมบูรณ์','1208คอนสาร','1209หนองบัวแดง','1211หนองบัวระเหว','1212เทพสถิต','1213บ้านแท่น','1214หนองบัวใหญ่','1215ชัยสามหมอ','1216เมืองพญาแล'); 
	arrBrn[13] = new Array('1300ระยอง','1301แกลง','1302ปลวกแดง','1303บ้านค่าย','1304วังจันทร์','1305เขาชะเมา','1307นิคมพัฒนา'); 
	arrBrn[14] = new Array('1400สุพรรณบุรี','1401สองพี่น้อง','1402อู่ทอง','1403บางปลาม้า','1404ดอนเจดีย์','1405สามชุก','1406ศรีประจันต์','1407ด่านช้าง','1408ตลาดกลางสินค้าเกษตรสุพรรณบุรี','1409เดิมบางนางบวช','1411หนองหญ้าไซ','1412ทุ่งคอก','1413ดอนคา','1414สวนแตง'); 
	arrBrn[15] = new Array('1500นครศรีธรรมราช','1501ทุ่งสง','1502จันดี','1503สิชล','1504ท่าศาลา','1505ชะอวด','1506ทุ่งใหญ่','1507หัวไทร','1508พิปูน','1509ร่อนพิบูลย์','1511ลานสกา','1512ฉวาง','1513ขนอม','1514ปากพนัง','1519พรหมคีรี','1521บางขัน','1522ไม้เสียบ','1523ต้นเหรียง','1524นบพิตำ','1525จุฬาภรณ์','1526เชียรใหญ่','1527ที่วัง','1528ถ้ำพรรณรา','1529นาบอน','1530ควนหนองหงษ์','1531ดอนแค','1532ปากพนังฝั่งตะวันตก','1533ทวดทอง','1534พระพรหม','1535ปากน้ำกลาย'); 
	arrBrn[16] = new Array('1600ลพบุรี','1601พัฒนานิคม','1602โคกสำโรง','1603ลำนารายณ์','1604บ้านหมี่','1605หนองม่วง','1606สระโบสถ์','1607ท่าวุ้ง','1609ลำสนธิ','1611ห้วยขุนราม','1612โคกตูม','1613โคกเจริญ'); 
	arrBrn[17] = new Array('1700ชัยนาท','1701หันคา','1702สรรคบุรี','1703วัดสิงห์','1704สรรพยา','1705สามง่ามท่าโบสถ์','1706เนินขาม','1707มโนรมย์','1708หนองมะโมง'); 
	arrBrn[18] = new Array('1800นครสวรรค์','1801ท่าตะโก','1802ลาดยาว','1803ตาคลี','1804หนองบัว','1805บรรพตพิสัย','1806พยุหะคีรี','1807ไพศาลี','1808ตากฟ้า','1809ชุมแสง','1811แม่วงก์','1812เก้าเลี้ยว','1813โกรกพระ','1814หนองเบน','1815ช่องแค','1816ชุมตาบง'); 
	arrBrn[19] = new Array('1900ชุมพร','1901ท่าแซะ','1903สวี','1904หลังสวน','1905มาบอำมฤต','1907ละแม','1909ทุ่งตะโก','1911ปะทิว','1912ปฐมพร','1913พะโต๊ะ','1914ทรัพย์อนันต์','1915เขาทะลุ','1916ท่าข้าม'); 
	arrBrn[20] = new Array('2000นนทบุรี','2001บางบัวทอง','2003ไทรน้อย','2004บางใหญ่','2007ปากเกร็ด'); 
	arrBrn[21] = new Array('2100นครราชสีมา','2101สีคิ้ว','2102ด่านขุนทด','2103ครบุรี','2104จักราช','2105โนนไทย','2106ปากช่อง','2107โชคชัย','2108ปักธงชัย','2109สูงเนิน','2111เสิงสาง','2112ห้วยแถลง','2113ขามสะแกแสง','2114พิมาย','2115บัวใหญ่','2116ชุมพวง','2117ประทาย','2118โนนสูง','2119คง','2120แก้งสนามนาง','2121ขามทะเลสอ','2122หนองบุญมาก','2123เฉลิมพระเกียรติ','2124พระทองคำ','2125โนนแดง','2126ลำทะเมนชัย','2127เทพารักษ์','2128สีดา','2129บ้านเหลื่อม','2130หนองบัวตะเกียด','2131สามแยกปัก','2132จอหอ','2133ดอนหวาย','2134วังน้ำเขียว'); 
	arrBrn[22] = new Array('2200ร้อยเอ็ด','2201สุวรรณภูมิ','2202โพนทอง','2203เกษตรวิสัย','2205จตุรพักตรพิมาน','2206เสลภูมิ','2207ธวัชบุรี','2208อาจสามารถ','2209พนมไพร','2211ปทุมรัตต์','2212โพธิ์ชัย','2213ศรีสมเด็จ','2214จังหาร','2215หนองพอก','2216ธงธานี','2217โพนทราย','2218เมยวดี','2219หนองฮี','2220เชียงขวัญ','2221บ้านข่า','2222เมืองบัว','2223เมืองใหม่สุวรรณภูมิ'); 
	arrBrn[23] = new Array('2300เชียงใหม่','2301จอมทอง','2302สันป่าตอง','2303สันกำแพง','2304แม่แตง','2305พร้าว','2307ฮอด','2308แม่โจ้','2309แม่วาง','2311ดอยสะเก็ด','2312หางดง','2313แม่ริม','2314ฝาง','2315ไชยปราการ','2316แม่อาย','2317ดอยหล่อ','2320เชียงดาว','2321แม่แจ่ม','2322สารภี','2323สะเมิง','2324แม่สูน','2325ดอยเต่า','2326เจดีย์แม่ครัว','2327แม่ออน','2328สันต้นหมื้อ','2329บ่อสร้าง','2330ทุ่งเสี้ยว','2331เมืองแกน','2332รวมโชค','2333หนองตอง','2334แม่ปั๋ง','2335แม่เหียะ','2336แม่สอย','2337อมก๋อย','2338เวียงแหง'); 
	arrBrn[24] = new Array('2400นครปฐม','2401บางเลน','2402กำแพงแสน','2403นครชัยศรี','2404สามพราน','2405ดอนตูม','2406บางหลวง','2007ราชภัฏนครปฐม'); 
	arrBrn[25] = new Array('2500ฉะเชิงเทรา','2501พนมสารคาม','2502บางน้ำเปรี้ยว','2503บางปะกง','2504บางคล้า','2505บ้านโพธิ์','2506สนามชัยเขต','2511แปลงยาว','2512ท่าตะเกียบ','2513คลอง 16'); 
	arrBrn[26] = new Array('2600สุรินทร์','2601สังขะ','2602ท่าตูม','2603ศีขรภูมิ','2604ปราสาท','2605ชุมพลบุรี','2606จอมพระ','2607รัตนบุรี','2608กาบเชิง','2609บัวเชด','2611ลำดวน','2612สำโรงทาบ','2613สนม','2614ศรีณรงค์','2615เขวาสินรินทร์','2616ระแงง','2617ถนนปัทมานนท์','2618เมืองใต้','2619หนองยาว','2620พนมดงรัก','2621ปราสาทเมืองใหม่'); 
	arrBrn[27] = new Array('2700พิษณุโลก','2702ชาติตระการ','2703เนินมะปราง','2704บางกระทุ่ม','2705นครไทย','2706วัดโบสถ์','2707วังทอง','2708บางระกำ','2709พรหมพิราม','2711หนองตม','2712หนองกุลา','2713ทรัพย์ไพรวัลย์','2714บ้านกร่าง','2715บ้านใหม่'); 
	arrBrn[28] = new Array('2800พิจิตร','2801สามง่าม','2802วังทรายพูน','2803โพธิ์ประทับช้าง','2804ตะพานหิน','2805บางมูลนาก','2806โพทะเล','2807ทับคล้อ','2808ดงเจริญ','2809บึงนาราง','2811สากเหล็ก','2812วชิรบารมี','2813ฆะมัง'); 
	arrBrn[29] = new Array('2900ลำปาง','2901เสริมงาม','2902แจ้ห่ม','2903งาว','2904เถิน','2905แม่ทะ','2906ห้างฉัตร','2907เกาะคา','2908วังเหนือ','2909สบปราบ','2911เขลางค์','2912แม่เมาะ','2913เมืองปาน','2914อาลัมภางค์'); 
	arrBrn[30] = new Array('3000อ่างทอง','3001โพธิ์ทอง','3002วิเศษชัยชาญ','3003แสวงหา'); 
	arrBrn[31] = new Array('3100สุราษฎร์ธานี','3101คีรีรัฐนิคม','3102กาญจนดิษฐ์','3103ไชยา','3104บ้านตาขุน','3105ท่าชนะ','3106ดอนสัก','3107พุนพิน','3108บ้านนาสาร','3109บ้านนาเดิม','3111เวียงสระ','3112พระแสง','3113เกาะสมุย','3115ท่าฉาง','3117เคียนซา','3118พนม','3119ชัยบุรี','3120เกาะพะงัน','3121บางสวรรค์','3122วิภาวดี','3123ท่าโรงช้าง','3124กรูด'); 
	arrBrn[32] = new Array('3200กาฬสินธุ์','3201กุฉินารายณ์','3202หนองกุงศรี','3203สมเด็จ','3204ยางตลาด','3205กมลาไสย','3206เขาวง','3207ห้วยเม็ก','3208คำม่วง','3209ท่าคันโท','3211นาคู','3212โคกศรี','3213ห้วยผึ้ง','3214สหัสขันธ์','3215นามน','3216สงเปลือย'); 
	arrBrn[33] = new Array('3300เลย','3301วังสะพุง','3302ด่านซ้าย','3303เชียงคาน','3304หนองหิน','3305เอราวัณ','3306ภูเรือ','3307ปากชม','3308ภูกระดึง','3309กำเนิดเพชร','3311นาด้วง','3312ท่าลี่','3313ผาขาว','3314บ้านธาตุ','3315ภูหลวง','3316หนองหญ้าปล้อง'); 
	arrBrn[34] = new Array('3400หาดใหญ่','3403คูหา','3404เทพา','3405ระโนด','3406สะเดา','3407นาทวี','3409สงขลา','3411สทิงพระ','3418คลองแงะ','3419ควนเนียง','3420สะบ้าย้อย','3421คลองหอยโข่ง','3422จะนะ','3424สิงหนคร','3425ลำไพล','3426หาดใหญ่ใน','3427กระแสสินธุ์','3428บ้านพรุ','3429สะท้อน','3430รัตภูมิ','3431ตะเครียะ'); 
	arrBrn[35] = new Array('3500ประจวบคีรีขันธ์','3501ปราณบุรี','3502กุยบุรี','3503บางสะพาน','3504เฉลิมพระเกียรติ (หัวหิน)','3505บางสะพานน้อย','3506ทับสะแก','3512สามร้อยยอด','3513เกาะยายฉิม','3514อ่าวน้อย'); 
	arrBrn[36] = new Array('3600กำแพงเพชร','3601สลกบาตร','3603คลองขลุง','3605ไทรงาม','3606พรานกระต่าย','3607คลองลาน','3608ปางศิลาทอง','3609บึงสามัคคี','3611ลานกระบือ','3612คลองแม่ลาย','3613ทรายทองวัฒนา','3614ขาณุวรลักษบุรี','3615โกสัมพีนคร','3616โค้งไผ่','3617คลองพิไกร','3618นครชุม'); 
	arrBrn[37] = new Array('3700สกลนคร','3701พรรณานิคม','3703อากาศอำนวย','3704โคกศรีสุพรรณ','3705พังโคน','3706วานรนิวาส','3707สว่างแดนดิน','3708บ้านม่วง','3709กุสุมาลย์','3711คำตากล้า','3712วาริชภูมิ','3713เจริญศิลป์','3714โพนนาแก้ว','3715ส่องดาว','3716ภูพาน'); 
	arrBrn[38] = new Array('3800นครพนม','3801บ้านแพง','3802ธาตุพนม','3803ศรีสงคราม','3804นาแก','3805ท่าอุเทน','3806ปลาปาก','3807เรณูนคร','3808โพนสวรรค์','3809นาหว้า'); 
	arrBrn[39] = new Array('3900ศรีสะเกษ','3901กันทรลักษ์','3902ขุขันธ์','3903ราษีไศล','3904อุทุมพรพิสัย','3905ขุนหาญ','3906กันทรารมย์','3907ปรางค์กู่','3908ศรีรัตนะ','3909โนนคูณ','3911ยางชุมน้อย','3912ห้วยทับทัน','3913น้ำเกลี้ยง','3914ไพรบึง','3915วังหิน','3916เบญจลักษ์','3917ภูสิงห์','3918พยุห์','3919ถนนพระวิหาร','3920โพธิ์ศรีสุวรรณ'); 
	arrBrn[40] = new Array('4000บุรีรัมย์','4001นางรอง','4002พุทไธสง','4003ประโคนชัย','4004ลำปลายมาศ','4005ละหานทราย','4006สตึก','4007กระสัง','4008คูเมือง','4009บ้านกรวด','4011นาโพธิ์','4012หนองกี่','4013โนนสุวรรณ','4014หนองหงส์','4015เฉลิมพระเกียรติ (บุรีรัมย์)','4016แคนดง','4017ชำนิ','4018ปะคำ','4019อิสาณ','4020ห้วยราช','4021พลับพลาชัย','4022บ้านใหม่ไชยพจน์','4023เมืองตลุง','4024ระกา'); 
	arrBrn[41] = new Array('4100นครนายก','4101องครักษ์','4102บ้านนา','4103ปากพลี'); 
	arrBrn[42] = new Array('4200จันทบุรี','4201ห้วยสะท้อน','4203ขลุง','4204สอยดาว','4206เขาคิชฌกูฏ','4207นายายอาม','4208แก่งหางแมว','4209โป่งน้ำร้อน'); 
	arrBrn[43] = new Array('4300ราชบุรี','4301จอมบึง','4302บ้านโป่ง','4303โพธาราม','4304ดำเนินสะดวก','4305สวนผึ้ง','4306บางแพ','4307ปากท่อ'); 
	arrBrn[44] = new Array('4400กาญจนบุรี','4401ท่าเรือพระแท่น','4402พนมทวน','4403เลาขวัญ','4404บ่อพลอย','4405น้ำตกไทรโยคน้อย','4406ท่าม่วง','4407หนองปรือ','4408ห้วยกระเจา','4409หนองฝ้าย'); 
	arrBrn[45] = new Array('4500พัทลุง','4502ควนขนุน','4503แม่ขรี','4504ปากพะยูน','4505เขาชัยสน','4506ป่าพะยอม','4511ป่าบอน','4512กงหรา','4513ศรีนครินทร์','4514ท่ามิหรำ','4515ปากคลอง','4516บางแก้ว','4517ศรีบรรพต','4518พรุพ้อ','4519ควนมะพร้าว'); 
	arrBrn[46] = new Array('4600มหาสารคาม','4601วาปีปทุม','4602พยัคฆภูมิพิสัย','4603โกสุมพิสัย','4604บรบือ','4605เชียงยืน','4606นาเชือก','4607กุดรัง','4608กันทรวิชัย','4609นาดูน','4611ยางสีสุราช','4612แพง','4613บ้านเขื่อน','4614ตลาดวาปีปทุม','4615สี่แยกพยัคฆ์','4616ตักสิลา','4617ตลาดบรบือ'); 
	arrBrn[47] = new Array('4700ลำพูน','4701ป่าซาง','4702ลี้','4703บ้านโฮ่ง','4704แม่ทา','4705บ้านธิ','4706เวียงหนองล่อง','4707อุโมงค์','4708แม่ตืน','4709นิคมอุตสาหกรรมลำพูน','4711บ้านแซม'); 
	arrBrn[48] = new Array('4800อุตรดิตถ์','4805ฟากท่า','4806ลับแล','4807ตรอน','4808น้ำปาด','4809พิชัย','4811พญาแมน','4812ท่าปลา','4813ทองแสนขัน','4814บ้านโคก','4815วังสีสูบ','4816ท่าสัก'); 
	arrBrn[49] = new Array('4900อุทัยธานี','4901ลานสัก','4902บ้านไร่','4903ทัพทัน','4904หนองฉาง','4905สว่างอารมณ์','4906เมืองการุ้ง','4907ห้วยคต - ทุ่งนา'); 
	arrBrn[50] = new Array('5000อุบลราชธานี','5001เดชอุดม','5003ตระการพืชผล','5004พิบูลมังสาหาร','5005เขมราฐ','5006เขื่องใน','5007น้ำยืน','5008วารินชำราบ','5009บุณฑริก','5011สำโรง','5012ม่วงสามสิบ','5013บ้านกอก','5014ศรีเมืองใหม่','5015ทุ่งศรีอุดม','5016โพธิ์ไทร-นาตาล','5017น้ำขุ่น','5018นาจะหลวย','5019สิรินธร','5020ตาลสุม','5021ชัยมงคล','5022เหล่าเสือโก้ก','5023คำเจริญ','5024กุดข้าวปุ้น'); 
	arrBrn[51] = new Array('5100ยโสธร','5101เลิงนกทา','5102มหาชนะชัย','5103กุดชุม','5104คำเขื่อนแก้ว','5105ป่าติ้ว','5106ค้อวัง','5107ไทยเจริญ','5108เมืองเลิง'); 
	arrBrn[52] = new Array('5200หนองคาย','5202โพนพิสัย','5203ท่าบ่อ','5206สังคม','5211เฝ้าไร่','5212ศรีเชียงใหม่','5213รัตนวาปี','5214เซิม'); 
	arrBrn[53] = new Array('5300ชลบุรี','5301พนัสนิคม','5302แหลมฉบัง','5303บ้านบึง','5304บ่อทอง','5305พานทอง','5306พัทยา','5312เกาะโพธิ์'); 
	arrBrn[54] = new Array('5400สมุทรสาคร','5408บ้านแพ้ว','5411กระทุ่มแบน'); 
	arrBrn[55] = new Array('5500นราธิวาส','5501สุไหงปาดี','5502ตันหยงมัส','5503รือเสาะ','5508แว้ง','5511ศรีสาคร','5513บาเจาะ'); 
	arrBrn[56] = new Array('5600น่าน','5601เวียงสา','5602ปัว','5603นาน้อย','5604ท่าวังผา','5605เชียงกลาง','5606สันติสุข','5607ภูเพียง','5608น้ำปั้ว','5609ปางค่า','5611นาหมื่น','5612ทุ่งช้าง'); 
	arrBrn[57] = new Array('5700ตรัง','5701ย่านตาขาว','5702กันตัง','5703ห้วยยอด','5704ทุ่งยาว','5705วังวิเศษ','5706สิเกา','5707นาโยง','5714รัษฎา','5715นาวง','5716เขาวิเศษ','5717รักษ์จันทน์','5718หาดเลา','5719หาดสำราญ'); 
	arrBrn[58] = new Array('5800จตุจักร','5801ภาษีเจริญ','5802มีนบุรี','5804บางบอน','5805ลาดกระบัง','5812นางเลิ้ง','5814หนองจอก','5816หมอชิต 2','5817สถานีขนส่งสายใต้','5818ศูนย์ราชการเฉลิมพระเกียรติ (อาคาร','5819ศูนย์ราชการเฉลิมพระเกียรติ (อาคารB)','5820สยามพาราไดซ์','5821สามแยกตรอกจันทน์','5822ถนนสิรินธร','5823ลาดพร้าว 101','5824บางเขน','5825ทุ่งครุ','5826ดิ โอลด์ สยาม พลาซ่า'); 
	arrBrn[60] = new Array('6000พังงา','6003ตะกั่วป่า','6004โคกกลอย','6009ท้ายเหมือง','6011ทับปุด','6012คุระบุรี','6013กะปง'); 
	arrBrn[61] = new Array('6100ยะลา','6101เบตง','6102บันนังสตา','6103ยะหา','6108รามัน'); 
	arrBrn[67] = new Array('6700ตลาดไท','6701คลอง 9','6702ลำลูกกา','6703ปทุมธานี','6704ลาดหลุมแก้ว'); 
	arrBrn[69] = new Array('6900สิงห์บุรี','6901อินทร์บุรี','6902บางระจัน','6903ค่ายบางระจัน'); 
	arrBrn[71] = new Array('7100หนองบัวลำภู','7101นากลาง','7102ศรีบุญเรือง','7103สุวรรณคูหา','7104โนนสัง','7105นาวัง','7106ยางหล่อ'); 
	arrBrn[72] = new Array('7200พะเยา','7201จุน','7202เชียงคำ','7203ดอกคำใต้','7204ปง','7205แม่ใจ','7206ภูซาง','7207เชียงม่วน','7208ภูกามยาว','7209แม่ต๋ำ','7211บ้านทราย','7212ถ้ำปิน','7213ทุ่งรวงทอง','7214ดอนไชย','7215บ้านต๋อม'); 
	arrBrn[73] = new Array('7300มุกดาหาร','7301นิคมคำสร้อย','7302คำชะอี','7303ดอนตาล','7304ดงหลวง'); 
	arrBrn[74] = new Array('7400สมุทรสงคราม','7401อัมพวา'); 
	arrBrn[75] = new Array('7500สตูล','7501ละงู','7502ควนกาหลง','7506ทุ่งหว้า','7508ท่าแพ'); 
	arrBrn[76] = new Array('7600กระบี่','7601อ่าวลึก','7602คลองท่อม','7603เขาพนม','7607ปลายพระยา','7608ลำทับ','7609เหนือคลอง','7612คลองพน'); 
	arrBrn[77] = new Array('7700อำนาจเจริญ','7701หัวตะพาน','7702ลืออำนาจ','7703เสนางคนิคม','7704ชานุมาน','7705ปทุมราชวงศา','7706พนา'); 
	arrBrn[78] = new Array('7800สระแก้ว','7801อรัญประเทศ','7802วังน้ำเย็น','7803วัฒนานคร','7804เขาฉกรรจ์','7805คลองหาด','7806ตาพระยา','7807วังสมบูรณ์'); 
	arrBrn[79] = new Array('7900ตราด','7901แสนตุ้ง'); 
	arrBrn[80] = new Array('8000สมุทรปราการ','8001บางบ่อ','8002บางพลี','8006พระสมุทรเจดีย์'); 
	arrBrn[81] = new Array('8100ตาก','8101แม่สอด','8102พบพระ','8104สามเงา','8105อุ้มผาง','8106แม่ระมาด','8107วังเจ้า','8108บ้านตาก','8109ท่าสองยาง'); 
	arrBrn[82] = new Array('8200แม่ฮ่องสอน','8201แม่สะเรียง','8202ปาย','8205ขุนยวม','8206แม่ลาน้อย'); 
	arrBrn[83] = new Array('8300ระนอง','8301กระบุรี','8303กะเปอร์','8305ละอุ่น'); 
	arrBrn[84] = new Array('8400ภูเก็ต','8401ถลาง','8404ป่าตอง'); 
	arrBrn[85] = new Array('8500บึงกาฬ','8501ปากคาด','8502โซ่พิสัย','8503เซกา','8504ศรีวิไล','8505พรเจริญ','8506บึงโขงหลง','8507บุ่งคล้า'); 

	function listData(id){			
		if(id!=""){		
			var objData =eval("arrData["+id+"]");
			var strOpt = "";
			
			document.forms(0).province.innerHTML ="";
			document.forms(0).branch.innerHTML ="";
			if (id==0) {			
				addOption("------สนจ.------",""); }
			else {	
				addOption("------สนจ.------","");
				for(x=0;x<objData.length;x++){
					addOption(objData[x],objData[x].substring(0,2));
				}		
			}
			var objData =eval("arrBrn["+id+"]");
			addOptionBrn("------สาขา------","");
		}
	}

	function addOption(text,value){
		var oOption = document.createElement("OPTION");
		document.forms(0).province.options.add(oOption);
		oOption.innerText =text.substring(2,text.length);
		oOption.value = value;
	}	
		
/*-----------------------------------------------------------------------*/
	function listBrn(id){
		if(id!=""){	
			var objBrn =eval("arrBrn["+id+"]");
			var strOpt = "";
		
			document.forms(0).branch.innerHTML ="";
			
				addOptionBrn("------สาขา------","");
				for(x=0;x<objBrn.length;x++){
					addOptionBrn(objBrn[x],objBrn[x].substring(0,4));
				}
		}
		else {
			document.forms(0).branch.innerHTML ="";
			addOptionBrn("------สาขา------","");		
		}
	}
	
	function addOptionBrn(text,value){
		var oOption = document.createElement("OPTION");
		document.forms(0).branch.options.add(oOption);
		oOption.innerText =text.substring(4,text.length);
		oOption.value = value;
	}	

	function listDiv(id){		
	var id1;
		if(id!=""){	
			id1=id;
			id = 0;		
			var objDiv =eval("arrDiv["+id+"]");
			var strOpt = "";	
			document.forms(0).div.innerHTML ="";	
			for(x=0;x<objDiv.length;x++){		 
				addOptionDiv(objDiv[x],objDiv[x].substring(0,1));
			}	
			document.forms(0).div.value= id1;
		}
	}

	function addOptionDiv(text,value){
		var oOption = document.createElement("OPTION");
		document.forms(0).div.options.add(oOption);
		oOption.innerText =text.substring(1,text.length);
		oOption.value = value;
	}	

</script>

<!-- jQuery (necessary for Bootstrap's JavaScript plugins) -->
<script src="js/jquery-1.10.2.min.js"></script>
<!-- Include all compiled plugins (below), or include individual files as needed -->
<script src="js/bootstrap.min.js"></script>
<script type="text/javascript" src="js/jquery.dataTables.js"></script>
<script type="text/javascript" src="js/DT_bootstrap.js"></script>
<script type="text/javascript" src="js/calendar.js"></script>
<script type="text/javascript" src="js/loadcalendar.js"></script>
<script type="text/javascript" src="js/calendar-th.js"></script>

<script type="text/javascript">

	// export to excel 
	$(function(){
		$("#exportToExcel").click(function() {
			var data='<table>'+$("#example").html().replace(/<a\/?[^>]+>/gi, '')+'</table>';
			$('body').prepend("<form method='post' action='exporttoexcel.php' style='display:none' id='ReportTableData'><input type='text' name='tableData' value='"+data+"' ></form>");
			$('#ReportTableData').submit().remove();
			 return false;
		});
	});

	function SubmitData(){

		$('#div_excel').hide();			// ซ่อนปุ่ม excel 
		// ส่งโดย POST jquery
		$.post("ajax_report.php", { number_ref:$("#number_ref").val() ,slt_type: $("#slt_type").val(), slt_result: $("#slt_result").val(), date_start: $("#date_start").val(), date_stop: $("#date_stop").val(), rd_type: $('input[name=rd_type]:checked', '#myForm').val() ,branch: $("#branch").val() },

			function(result) {
				$("#div_result").html(result);
				$("#div_result").show();		// แสดงผลลัพธ์
				$("#div_excel").show();		// แสดงปุ่ม excel

				$('#example').dataTable( {
					"sDom": "<'row'<'span6'l><'span6'f>r>t<'row'<'span6'i><'span6'p>>",
					"sPaginationType": "bootstrap",
					"oLanguage": {
						"sLengthMenu": "_MENU_ records per page"
					}
				} ); // end function result

			},''); // end post 
	} // end function SubmitData

</script>

</head>
<body>

<div class="container" >
<div class="row" style='margin-top:5px; margin-bottom:10px;'>
	<div class="col-md-9 col-md-offset-1">
		<div class="panel-group" id="accordion">
			<div class="panel panel-default">
				<div class="panel-heading">
					<h4 class="panel-title"><a data-toggle="collapse" data-parent="#accordion" href="#collapseOne"> แสดงรายงาน </a></h4>
				</div>
				<div id="collapseOne" class="panel-collapse collapse in">
					<div class="panel-body" style='padding:7px'>

						<form id="myForm">
							<table width='100%' border='0' >
						<?		if($type_online=='1'){ ?>
								<tr>
									<td>สาขา </td>
									<td>
										<select id='branch' name='branch' class="form-control input-sm">
											<option value='<?=$brcode_online?>'><?=$division_name_online ?></option>
										</select>
									</td>
								</tr>
						<? }elseif($type_online=='2'){ ?>
								<tr>
									<td>สาขา </td>
									<td>
										<select id="div" class="form-control input-sm" onChange=" javascript:listData(this.value)" >
											<option value="0">--รวมประเทศ--</option>
											<option value="1">ภาคเหนือตอนบน</option>
											<option value="2">ภาคเหนือตอนล่าง</option>
											<option value="3">ภาคตะวันออกเฉียงเหนือตอนบน</option>
											<option value="4">ภาคตะวันออกเฉียงเหนือตอนล่าง</option>
											<option value="5">ภาคกลาง</option>
											<option value="6">ภาคตะวันออก</option>
											<option value="7">ภาคตะวันตก</option>
											<option value="8">ภาคใต้ตอนบน</option>
											<option value="9">ภาคใต้ตอนล่าง</option>
										</select>
									</td>
									<td>
										<select id="province" class="form-control input-sm" onChange=" javascript:listBrn(this.value)" >
											<option value="0">--สำนักงานจังหวัด--</option>
										</select>
									</td>
									<td>
										<select id="branch" class="form-control input-sm" >
											<option value="0" >--สาขา--</option >
										</select> 
									</td>
								</tr>
						<? } // end if type_online ?>
								<tr>
									<td> ประเภทของข้อมูล </td>
									<td align='left'>
										<div class="form-group has-error" style='margin-bottom:0px'>
											<select id='slt_type' name='slt_type' class="form-control input-sm">
										<?		// แสดงประเภทข้อมูลของ risk ทังหมด
												foreach($array_data as $key=>$value){
										?>
												<option value='<?=$key?>'><?=$value ?></option>
										<?		} // end foreach ?>
											</select>
										</div>
									</td>
									<td>&nbsp;</td>
									<td colspan='2'> ผลการค้นหา</td>
									<td colspan='2'>
										<select id='slt_result' name='slt_result' class="form-control input-sm">
											<option value='all'>ทั้งหมด</option>
											<option value='1'>พบ</option>
											<option value='0'>ไม่พบ</option>
										</select>
									</td>
								</tr>
								<tr>
									<td> เลือก </td>
									<td><input type="radio" name="rd_type" id="rad01" value="1" checked> แสดงทั้งหมด &nbsp;&nbsp;<input type="radio" name="rd_type" id="rad02" value="2" > ระหว่างวันที่</td>
									<td><input type="text" id="date_start" name="date_start" class="form-control" size='10' value='<?=$date_report ?>' readonly></td>
									<td><img src="images/date.gif" alt=".เลือกวันที่." align="absmiddle" onclick=" return showCalendar('date_start','dd-mm-y');" onmouseover="this.style.cursor='hand'"; ></td>
									<td align='center'>ถึง</td>
									<td><input type="text" id="date_stop" name="date_stop" class="form-control" size='10' value='<?=$date_report ?>' readonly></td>
									<td><img src="images/date.gif" alt=".เลือกวันที่." align="absmiddle" onclick=" return showCalendar('date_stop','dd-mm-y');" onmouseover="this.style.cursor='hand'"; ></td>
								</tr>
								<tr>
									<td> CDD Ref. No. </td>
									<td colspan='2'><input type="text" id="number_ref" name="number_ref" class="form-control" size='15' value='' maxlength='30'></td>
								</tr>
								<tr>
									<td></td>
									<td><button type="button" class="btn btn-primary glyphicon glyphicon-search" style='padding:10px' onclick=" SubmitData() " > แสดงข้อมูล </button>&nbsp;</td>
									<td colspan='5'>&nbsp;</td>
								</tr>
							</table>
						</form>
					</div><!-- End div panel-body -->
				</div><!-- End div CollapseOne -->
			</div><!-- End div panel panel-default -->
		</div><!-- End div panel-group -->
	</div><!-- End div col-md9 offset1 -->
</div><!-- End div row -->

<!-- ****************************************************  พื้นที่แสดงผลข้อมูล Result ************************************************* -->
<br>
<div id='div_result' style="display:none"></div>
<!-- **************************************************  END พื้นที่แสดงผลข้อมูล Result ********************************************* -->
</div><!-- End div container -->
<div id='div_excel' style="display:none"><center><a href="#" id="exportToExcel"><img src='images/icons/page_excel.png'> ข้อมูล Excel </a></center></div>
<br>

</body>
</html>